<a href="https://colab.research.google.com/github/Bowmmin/dfe-shanata-python/blob/main/03_Python_Pandas_DataFrames.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [9]:
import numpy as np
import pandas as pd
import datetime

## DataFrames

In [10]:
students = ['Alice', 'Bob', 'Emily', 'Charlie']

In [ ]:
scores = [90, 80, 65, 50]

In [11]:
exam_results = pd.DataFrame(
    {
        "name": students,
        "scores": scores
    }
)

In [12]:
exam_results

      name  scores
0    Alice      90
1      Bob      80
2    Emily      65
3  Charlie      50

### Searching (SQL SELECT)

In [13]:
exam_results.loc[0, 'scores'] # location-> rowid, column_NAME(s)

90

In [14]:
exam_results.loc[:, 'scores']

0    90
1    80
2    65
3    50
Name: scores, dtype: int64

In [15]:
exam_results.loc[2, :]

name      Emily
scores       65
Name: 2, dtype: object

In [16]:
exam_results['scores']

0    90
1    80
2    65
3    50
Name: scores, dtype: int64

In [32]:
exam_results[['name', 'scores']]
# on DataFrame->  filtering happens on COLUMN LEVEL

      name  scores
0    Alice      90
1      Bob      80
2    Emily      65
3  Charlie      50

### Add Columns

We can also easily add columns

In [18]:
gender = ['female', 'male', 'female', 'male']

In [19]:
exam_results['gender'] = gender
# Creates a new dataframe with a new column called Gender

In [20]:
exam_results

      name  scores  gender
0    Alice      90  female
1      Bob      80    male
2    Emily      65  female
3  Charlie      50    male

In [21]:
exam_results['scores']

0    90
1    80
2    65
3    50
Name: scores, dtype: int64

### Remove Columns

In [30]:
exam_results.drop('name', axis=1)
# axis=1 means column wise
# axis=0 means row wise 
# 0 means index (flows through rows), 1 is for [column_names]

   scores  gender
0      90  female
1      80    male
2      65  female
3      50    male

### Column names and Row Index

In [38]:
exam_results.columns
#axis=1

Index(['name', 'scores', 'gender'], dtype='object')

In [34]:
exam_results.index
#axis=0

RangeIndex(start=0, stop=4, step=1)

### Renaming Columns

In [39]:
exam_results.rename({'name': 'first_name'}, axis=1)

  first_name  scores  gender
0      Alice      90  female
1        Bob      80    male
2      Emily      65  female
3    Charlie      50    male

### Dealing with missing values

Dataframes have specific commands which help with the handling of missing data

In [53]:
sparse = pd.DataFrame({'a': [1, 2, 3, 4],
                       'b': [np.nan, 4, np.nan, 7],
                       'c': [5, np.nan, np.nan, 8],
                       'd': [9, 4, 10, 7]})

In [54]:
sparse

   a    b    c   d
0  1  NaN  5.0   9
1  2  4.0  NaN   4
2  3  NaN  NaN  10
3  4  7.0  8.0   7

In [55]:
sparse.isna()

       a      b      c      d
0  False   True  False  False
1  False  False   True  False
2  False   True   True  False
3  False  False  False  False

In [56]:
sparse.fillna(0) # fill those null values with 0

   a    b    c   d
0  1  0.0  5.0   9
1  2  4.0  0.0   4
2  3  0.0  0.0  10
3  4  7.0  8.0   7

In [57]:
sparse.dropna(axis=1) # axis=1 means column level dropping

   a   d
0  1   9
1  2   4
2  3  10
3  4   7

In [59]:
sparse = pd.DataFrame({'a': [1, 2, 3],
                       'b': [np.nan, 4, np.nan],
                       'c': [5, np.nan, np.nan]})
sparse.fillna(0)
sparse.dropna() # axis=0-> row wise!
# everything dropped-> each row contained at least 1 null value!

Empty DataFrame
Columns: [a, b, c]
Index: []

In [60]:
sparse = pd.DataFrame({'a': [1, 2, 3, 4],
                       'b': [np.nan, 4, np.nan, 7],
                       'c': [5, np.nan, np.nan, 8],
                       'd': [9, 4, 10, 7]})
sparse.fillna(0)
sparse.dropna()

   a    b    c  d
3  4  7.0  8.0  7

### Group by

In [63]:
exam_results

      name  scores  gender
0    Alice      90  female
1      Bob      80    male
2    Emily      65  female
3  Charlie      50    male

In [66]:
exam_results.groupby('gender').mean()
# SQL made a lot easier!
# Select mean(*) from exam_results group by gender

        scores
gender
female    77.5
male      65.0

In [62]:
mylist = [1,2,1,2]

exam_results.groupby(mylist).get_group(1)

    name  scores  gender
0  Alice      90  female
2  Emily      65  female

In [67]:
exam_results.groupby(mylist).get_group(2)

      name  scores gender
1      Bob      80   male
3  Charlie      50   male

Thus, suppose we want to group people who obtained marks above or below 70, then we could do:

In [68]:
above_70 = exam_results['scores'] > 70
above_70

0     True
1     True
2    False
3    False
Name: scores, dtype: bool

This will compute the mean scores of students who scored above or below 70

In [69]:
exam_results.groupby(above_70).mean()

        scores
scores
False     57.5
True      85.0

### Merge and Joining

In [80]:
contacts = pd.DataFrame(
    {
        'name' : ['Alice', 'Charlie', 'Bob'],
        'tel'  : ['+44 1234 5678', '+44 3245 5564', '123456']
    }
)

In [81]:
exam_results.merge(contacts, left_on='name', right_on='name')   
# defaults to inner join
# inner join-> Set INTERSECTION

      name  scores  gender            tel
0    Alice      90  female  +44 1234 5678
1      Bob      80    male         123456
2  Charlie      50    male  +44 3245 5564

In [82]:
exam_results.merge(contacts, left_on='name', right_on='name', how='outer')
# Null values for Bob and Emily because on outer join, no data present!
# outer join-> Set Union

      name  scores  gender            tel
0    Alice      90  female  +44 1234 5678
1      Bob      80    male         123456
2    Emily      65  female            NaN
3  Charlie      50    male  +44 3245 5564